# Energy Analysis Zone Use Dehumidification Set Point Property

Source: https://www.revitapidocs.com/2026/8b6a5da4-9f3b-6d49-76fe-dc3091452dc1.htm

---

| Energy Analysis Zone Use Dehumidification Set Point Property |
| --- |

Use the dehumidification set point.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public bool UseDehumidificationSetPoint { get; }
```

```
Public ReadOnly Property UseDehumidificationSetPoint As Boolean
	Get
```

```
public:
property bool UseDehumidificationSetPoint {
	bool get ();
}
```

```
member UseDehumidificationSetPoint : bool with get
```

#### Property Value

Boolean See Also

#### Reference

EnergyAnalysisZone Class Autodesk.Revit.DB.Analysis Namespace